package kg.geeks.compose.data

object SampleData {
    val books = listOf(
        Book(1, "1984", "Джордж Оруэлл", "Роман-антиутопия о тоталитарном будущем.", "Фантастика"),
        Book(2, "Преступление и наказание", "Ф.М. Достоевский", "Роман о морали и справедливости.", "Классика"),
        Book(3, "Гарри Поттер", "Дж.К. Роулинг", "История о мальчике-волшебнике.", "Фэнтези"),
        Book(4, "Мастер и Маргарита", "М. Булгаков", "Мистический роман о любви и дьяволе.", "Классика"),
        Book(5, "Властелин колец", "Дж.Р.Р. Толкин", "Фэнтезийный эпос о борьбе добра и зла.", "Фэнтези")
    )

    val categories = listOf("Все", "Фантастика", "Классика", "Фэнтези")
}